---
kind: property
id: P:Autodesk.Revit.UI.Events.BeforeExecutedEventArgs.UsingCommandData
source: html/604c4a88-6d23-9067-125d-3ddac0548bbb.htm
---
# Autodesk.Revit.UI.Events.BeforeExecutedEventArgs.UsingCommandData Property

Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.

## Syntax (C#)
```csharp
public bool UsingCommandData { get; set; }
```

## Remarks
For details about the use of journal data associated to a command, see JournalData .
The default value is false.